<template>
  <main class="wrapper-content">
    <form  class="tab">
      <div class="tab__item">
        <input
          type="radio"
          name="tab-1"
          id="tab-00"
          class="tab__item-input"
          value="Все"
          v-model="filterCategory"
          >
        <label for="tab-00"  class="tab__item-label text">
          Все
        </label>
      </div>
      <div class="tab__item">
        <input
          type="radio"
          name="tab-1"
          id="tab-0"
          class="tab__item-input"
          value="СМИ"
          v-model="filterCategory"
          >
        <label for="tab-0"  class="tab__item-label text">
          СМИ
        </label>
      </div>
      <div class="tab__item">
        <input
          type="radio"
          name="tab-1"
          id="tab-1"
          class="tab__item-input"
          value="Новость"
          checked
          v-model="filterCategory"
          >
        <label for="tab-1"  class="tab__item-label text">
          Новости
        </label>
      </div>
      <div class="tab__item">
        <input
          type="radio"
          name="tab-1"
          id="tab-2"
          class="tab__item-input"
          value="Фото"
          v-model="filterCategory"
          >
        <label for="tab-2"  class="tab__item-label text">
          Фото
        </label>
      </div>
      <div class="tab__item">
        <input
          type="radio"
          name="tab-1"
          id="tab-3"
          class="tab__item-input"
          value="Видео"
          v-model="filterCategory"
          >
        <label for="tab-3"  class="tab__item-label text">
          Видео
        </label>
      </div>
    </form>
    <section class="block-content">
      <div class="posts" >
        <div
          class="posts__item"
          v-for="(card, index) in filter" 
          :key="card.id">
          <div class="posts__item-bg"
              :style='{ backgroundImage: "url(" + card.img + ")", }'
          >
            <p class="posts__item-category">
              {{card.category}}
            </p>
          </div>
          <div class="posts__item-info">
            <h3 class="posts__item-title">
              {{ card.title }}
            </h3>
            <p class="posts__item-txt">
              {{ card.text }}
            </p>
          </div>
        </div>
      </div>
    </section>
  </main>
  
</template>

<script>
export default{
  data() {
    return {
      cards: [],
      urlArr: [
          {
            "id": 1,
            "img": "https://images.pexels.com/photos/430208/pexels-photo-430208.jpeg?cs=srgb&dl=pexels-scott-webb-430208.jpg&fm=jpg",
            "title": "Методология БЭМ",
            "category": "Новость",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          },
          {
            "id": 2,
            "img": "https://media.istockphoto.com/photos/innovation-and-science-concept-picture-id1177116437",
            "title": "Заголовок новости",
            "category": "Новость",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          },
          {
            "id": 3,
            "img": "https://media.istockphoto.com/photos/technical-support-concept-maintenance-sign-wrench-and-srewdriver-picture-id1199145131",
            "title": "Методология БЭМ",
            "category": "Фото",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          },
          {
            "id": 4,
            "img": "https://media.istockphoto.com/photos/close-up-watching-picture-id1128252197",
            "title": "Методология БЭМ",
            "category": "СМИ",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          },
          {
            "id": 5,
            "img": "https://media.istockphoto.com/photos/aerial-view-of-crowd-connected-by-lines-picture-id1180187740",
            "title": "Методология БЭМ",
            "category": "Видео",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          },
          {
            "id": 6,
            "img": "https://images.pexels.com/photos/270700/pexels-photo-270700.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
            "title": "Заголовок такой-то",
            "category": "Фото",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          },
          {
            "id": 7,
            "img": "https://images.pexels.com/photos/2004161/pexels-photo-2004161.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
            "title": "Пиксель",
            "category": "СМИ",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          },
          {
            "id": 8,
            "img": "https://images.pexels.com/photos/270637/pexels-photo-270637.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
            "title": "О СЕО",
            "category": "СМИ",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          },
          {
            "id": 9,
            "img": "https://images.pexels.com/photos/1779487/pexels-photo-1779487.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=750&w=1260",
            "title": "Методология БЭМ",
            "category": "Видео",
            "text": "Html разметка построенна по методология БЭМ. Блок Элемент Модификтор. Данный подход к разработке кода позволяет создавать блоки, которые можно переиспользовать на любой другой странице или даже использовать в других проектах. Это происходит за счёт компонентной разработки, разделения классов html по их назначению, каждый класс должен отвечать за одну особенность стиля. Для каждого блока/элемента предусмотрен свой класс: для текста, кнопоп, форм ввода и т.д."
          }
      ],
      filterCategory: 'Все'

    }
  },
  computed: {
    filter() {
      let arr = this.urlArr
      arr = arr.filter((value) => {
        if (this.filterCategory === "Все") {
          return true
        } else {
          return value.category === this.filterCategory
        }

      })
      return arr
    }
  }
  
}
</script>
